"""
Tree의 개념
-> 비선형 구조로 원소들 간에 1:n 관계를 가지는 자료구조
1) 원소들 간에 계층관계를 가지는 계층형 자료구조
2) 상위 원소에서 하위 원소로 내려가면서 확장되는 Tree(나무)모양의 구조


Tree의 특성
1) 한 개 이상의 노드로 이루어진 유한 집합
-> 루트(Root): 노드 중 최상위 노드
-> 나머지 노드들: n(>= 0)개의 분리 집합 T1, ''', Tn으로 분리될 수 있음

2) 이들 T1,''',Tn은 각각 하나의 트리가 되며(재귀적 정의) 루트의 서브트리(Sub Tree)라고 함


Tree의 구성요소
노드(node)
-> 트리의 원소
-> 트리 T의 노드 A, B, C, D, E, F, G, H, I, J, K

간선(edge)
-> 노드를 연결하는 선
-> 부모 노드와 자식 노드를 연결

루트노드(Root Node)
: 트리의 시작 노드

형제 노드(Sibling node)
: 같은 부모의 노드의 자식 노드들

조상 노드(Ancestor node)
: 간선을 따라 루트 노득까지 이르는 경로에 있는 모든 노드

서브트리(SubTree)
: 부모 노드와 연결된 간선을 끊었을 때 생성되는 트리

자손 노드(Descendent node)
: 서브트리에 있는 하위 레벨의 노드들


차수(Degree)
: 트리에 있는 노드의 차수 중에서 가장 큰 값

노드이 높이
-> 루트(Root): 노드 중 최상위 노드, 보통 최상위 노드
-> 노드의 레벨

트리의 높이
-> 트리에 있는 노드의 높이 중에서 가장 큰 값, 보통 최상위 노드(Root)는 0
-> 최대 레벨





"""










